---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsStartConnectorPresent
source: html/95716e5c-3765-0482-de92-d81a644bf158.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsStartConnectorPresent Property

Whether a perpendicular segment is constructed
 from the start of the 2D shape.

## Syntax (C#)
```csharp
public bool IsStartConnectorPresent { get; }
```